'''

1)for loop-ის საშუალებით ტერმინალში გამოიტანეთ 2-დან 50-ის ჩათვლით ნომრები ოღონდ ნაბიჯი იყოს 4
ანუ ყოველ i-ს თითეულ ნაბიჯზე დაემატოს 4

'''
# for i in range(2,50 + 1, 4): 
#     print(i)


'''
2) for loop-ის საშუალებით ტერმინალში გამოიტანეთ  10-ჯერ ყოველი ( i ელემენტი და გვერდით მიუწერეთ, "GOA")
i --------- საიტერაციო ცვლადი

'''
for i in range(10): 
    print(str (i) + "    goa")


    '''
    3) დაწერეთ პროგრამა for loop-ის გამოყენებით, რომელიც გამოგვიტანს ჯერ ლუწს და შემდეგ კენტს.
თუ გაიაზრებთ მარტივია ძალიან
    
    '''

for i in range(0,20 + 1,2):
    print(i)
for i in range(1,20 + 1,2):
    print(i)


    '''
    4) შექმენით პროგრამა სადაც გამოიყენებთ While loop - ს. 
თქვენი დავალება იქნება ის, რომ მომხამრებელს შემოატანინოთ რიცხვი და თქვენ უნდა გამოიცნოთ ეს რიცხვი,
 ხოლო ყოველ არ გამოცნობილ რიცხვზე ისევ თავიდან უნდა შეგეკითხოთ და შეიყვანოთ რიცხვი.
    
    '''
num1 = int(input("please enter your num1: "))
guess = int(input("please enter your guess: "))
while guess != num1:  
    guess = int(input("please enter your guess: "))
print("you guessed the number")